class Question {
    constructor(text,img,options,answer){
        this.text = text;
        this.img = img;
        this.options = options;
        this.answer = answer;
    }
}


const questions = [
    new Question("Амазон се улива у..","nis",['Средоземно море','Атлантски океан','Индијски океан','Северно море'],'Атлантски океан'),
    new Question("Пингвини живе на..","nis",['Северном полу','Сибиру','Јужном полу','Хималајима'],'Јужном полу'),
    new Question("У грби једногрбе или двогрбе камиле налази се?","nis",['Вода','Храна','Ваздух','Масно ткиво'],'Масно ткиво'),
    new Question("Планета са прстеном се зове?","nis",['Јупитер','Марс','Нептун','Сатурн'],'Сатурн'),
    new Question("У књизи о џунгли, Могли има два пријатеља од којих је један медвед Балу, а други пантер..",
    "nis",['Ка','Багира','Пердита','Шир Кан'],'Багира'),
    new Question("Главни град Русије је.. ","nis",['Москва','Кијев','Варшава','Пекинг'],'Москва'),

    new Question("Како се зове сила која привлачи предмете на земљу ?","nis",['Магнет','Гравитација','Атомска сила','Плима'],'Гравитација'),
    new Question("Како се зове наша галаксија ?","nis",['Млечни пут','Андромеда','Еуропа','Сунцалис'],'Млечни пут'),
    new Question("Кроз колико земаља протиће Дунав","nis",['10','8','12','9'],'10'),
    new Question("Кинологија је наука о?","nis",['Псима','Филмовима','Рибама','Вулканима'],'Псима'),
    new Question("Која је скраћеница Међународне Кошаркашке Федерације?","nis",['ФИФА','НБА','ФИБА','НХЛ'],'ФИБА'),
    new Question("Србија се не граничи са.. ","nis",['Словенијом','Хрватском','Румунијом','Северном Македонијом'],'Словенијом'),

    new Question("Мање небеско тело које кружи око већег небеског тела се назива?","nis",['Метеорит','Комета','Сателит','Метеор'],'Сателит'),
    new Question("Планета која је 2006. изгубила свој статус је?..","nis",['Нептун','Меркур','Плутон','Венера'],'Плутон'),
    new Question("На једној руци има 5 прстију, а на две руке 10 прстију. Колико прстију има на 10 руку?","nis",['25','50','100','200'],'50'),
    new Question("Анина мама има три ћерке. Jедна се зове Мира, а друга Јелена. Како се зове трећа ћерка","nis",['Марија','Ана','Софија','Тања'],'Ана'),
    new Question("Два коња упрегнута у кочију прешла су 20 километара. Колико је прешао сваки коњ?","nis",['20','10','5','25'],'20'),
    new Question("Колико минута траје једно полувреме фудбалске утакмице? ","nis",['30','45','60','90'],'45'),
    new Question("Главни град Португалије је..","nis",['Порто','Лисабон','Мадрид','Париз'],'Лисабон'),
    
    new Question("Најдужа река у Италији је?","nis",['Елба','По','Рајна','Об'],'По'),
    new Question("Која од ових риба живи и у слаткој и у сланој води?","nis",['Лосос','Зубатац','Смуђ','Скуша'],'Лосос'),
    new Question("Прво живо биће у свемиру је пас..","nis",['Плутон','Леси','Маза','Лајка'],'Лајка'),
    new Question("Прву механичку оловку је 1938. године патентирао..","nis",['Славољуб Пенкала','Фауст Франчић','Руђер Бошковић','Милутин Миланковић'],'Славољуб Пенкала'),
    new Question("Вакцину против беснила изумео је..","nis",['Луј Пастер','Алфред Нобел','Руђер Бошковић','Пјер Кири'],'Луј Пастер'),

];
